-- Лабораторна робота №1
-- Студента групи КН-31 Данг Тхань. Варіант 10

-- Завдання 1   Наведiть приклади виразiв вказаного типу. Кожен список має мiстити
-- кiлька елементiв. Перегляньте тип прикладiв, як їх визначає ghci. Про-
-- коментуйте.
cart :: (([Double], [Char]), [Integer])
cart = (([1.22, 1.1, 2.54, 31.2],['f', 'p', 'c', 's']),[2, 0, 2, 2])

-- Результат команди 'type cart':
-- cart :: (([Double], [Char]), [Integer])

-- Завдання 2   Функцiя приймає три числа i повертає найменше з них.
f1 :: (Integer , Integer , Integer) -> Integer 
f1 (x,y,z) = 
    if min x y < z 
        then min x y
    else z

minin x y z = 
    if min x y < z 
        then min x y
    else z

-- Висновок: на цій лабораторній роботі я ознайомився з основними типами мови. Ознайомився зi структурою та
-- функцiями Glasgow Haskell Compiller. Набув навичок роботи з iнтерпретатором
-- ghci та визначення найпростiших функцiй.